---
kind: type
id: T:Autodesk.Revit.Exceptions.ModificationForbiddenException
source: html/53205486-5917-7c33-8e67-e362106ddc97.htm
---
# Autodesk.Revit.Exceptions.ModificationForbiddenException

The exception that is thrown by the undo transaction framework when a modification operation is not allowed.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ModificationForbiddenException : InvalidOperationException
```

## Remarks
See also: [!:Autodesk::Revit::DB::Element::IsModifiable] and [!:Autodesk::Revit::DB::Document::IsModifiable] .